/******************************************************************************
                      普源精电科技有限公司版权所有(2021-2031)
*******************************************************************************
  源文件名: watchdog.h
  功能描述: 头文件包含

  作    者: sn03955
  版    本: V1.00
  完成日期: 2021年10月20日

  修改历史：


******************************************************************************/


#ifndef _WATCHDOG_H
#define _WATCHDOG_H

int checkProcessExist(char *name);
int restartApp(char *name);
void logMake(char *name);


#endif
