/*******************************************************************************
                普源精电科技技术有限公司版权所有
********************************************************************************
  源文件名: system_clock_HAL.h
  功能描述: 系统时钟的HAL层函数的头文件
  作    者: ShuJie
  版    本: Ver1.0
  创建日期: 2022.02.16sss
    
  修改历史:
  修改日期：
  版 本 号：
  修 改 人：
  修改内容：
*******************************************************************************/


#ifndef __SYSTEM_CLOCK_HAL_H__
#define __SYSTEM_CLOCK_HAL_H__


typedef signed int DevStatus;


/*******************************************************************************
  * 函    数：DevBoardClock_Init
  * 描    述：系统时钟初始化，初始化系统时钟参数
  * 输入参数：无
  * 输出参数：无
  * 返 回 值：0 成功
  *          -1 失败
  * 说    明：外部函数
 ******************************************************************************/

DevStatus DevBoardClock_Init(void);

/*******************************************************************************
  * 函    数：DevBoardClock_GetVersion
  * 描    述：获取系统时钟的版本
  * 输入参数：无
  * 输出参数：Version: 系统时钟版本号
  * 返 回 值：0 成功
  *          -1 失败
  * 说    明：外部函数
 ******************************************************************************/
 
DevStatus DevBoardClock_GetVersion(int *Version);

/*******************************************************************************
  * 函    数：DevBoardClock_SelfTest
  * 描    述：主板系统时钟自测试
  * 输入参数：无
  * 输出参数：无
  * 返 回 值：0 成功
  *          -1 失败
  * 说    明：外部函数
 ******************************************************************************/
 
DevStatus DevBoardClock_SelfTest(void);

/*******************************************************************************
  * 函    数：DevBoardClcok_Exception
  * 描    述：主板时钟的异常信息
  * 输入参数：无
  * 输出参数：Exception 主板时钟的异常状态，0-正常，1-异常状态
  * 返 回 值：0 成功
  *          -1 失败
  * 说    明：外部函数
 ******************************************************************************/

DevStatus DevBoardClcok_Exception(int *Exception);

/*******************************************************************************
  * 函    数：DevBoardClcok_GetStatus
  * 描    述：查询主板时钟的工作状态
  * 输入参数：无
  * 输出参数：Status：时钟的工作状态，0 – Locked, 1 – Not Locked
  * 返 回 值：0 成功
  *          -1 失败
  * 说    明：外部函数
 ******************************************************************************/

DevStatus DevBoardClcok_GetStatus(int *Status);

/*******************************************************************************
  * 函    数：DevBoardClcok_Ouput
  * 描    述：查询主板时钟的输出开关
  * 输入参数：Out：0 – 关闭，1- 输出
  * 输出参数：无
  * 返 回 值：0 成功
  *          -1 失败
  * 说    明：外部函数
 ******************************************************************************/

DevStatus DevBoardClcok_Ouput(bool Out);


DevStatus DevBoardClcok_SetFrequency(double Frequency);

#endif /*__SYSTEM_CLOCK_HAL_H__*/
